<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","backend":"ddfb5083c659b5f5cd116fbeff347636ac76403b2f78f70e52a1c97cc269b1d6","plan_job_ref":"Job Create terraform plan on Pull Request #8 at https://github.com/markwcodes/personal-website-infra/actions/runs/6683056049","plan_hash":"7b15c655fe60544da9c9fa91306adba69c8159a2d8f38d1f09df00a1e1738b46","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __terraform__ in the __staging__ workspace
With var files: `terraform/terraform.tfvars`
With variables: `do_token = (sensitive value)`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_certificate.primary_domain_cert will be created
  + resource "digitalocean_certificate" "primary_domain_cert" {
      + domains          = [
          + "staging.wilson.codes",
        ]
      + id               = (known after apply)
      + name             = "staging-staging.wilson.codes"
      + not_after        = (known after apply)
      + sha1_fingerprint = (known after apply)
      + state            = (known after apply)
      + type             = "lets_encrypt"
      + uuid             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan on Pull Request #8](https://github.com/markwcodes/personal-website-infra/actions/runs/6683056049)